Revit 2027 API
BalusterInfo.BalusterFamilyId Property
 The id of the family used for the baluster or post.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BalusterFamilyId { get; set; }
Public Property BalusterFamilyId As ElementId
	Get
	Set
public:
property ElementId^ BalusterFamilyId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BalusterFamilyId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The balusterFamilyId doesn't refer to a valid baluster family.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace